from flask import Flask, jsonify, request
import os
import json
import requests

app = Flask(__name__)

@app.route('/')
def index():
    a=os.environ['Authorization']
    return a

@app.route("/webhook", methods=['POST'])
def webhook():
    if request.method == 'POST':
        return "OK"

@app.route('/callback', methods=['POST'])
def callback():
    json_line = request.get_json()
    json_line = json.dumps(json_line)
    decoded = json.loads(json_line)
    user = decoded['originalDetectIntentRequest']['payload']['data']['replyToken']
    userText = decoded['queryResult']['intent']['displayName']
    #sendText(user,userText)
    if (userText == '1') :
        sendText(user,'ความหมายอาเซียน อาเซียน เกิดจากการรวมตัวกันของ 10 ประเทศ อันได้แก่ มาเลเซีย พม่า กัมพูชา ลาว ไทย สิงคโปร์ เวียดนาม บรูไนดารุส-ซาลาม ฟิลิปปินส์ และอินโดนีเซีย ซึ่งรายนามประเทศเหล่านี้เป็นประเทศที่ตั้งอยู่ในทวีปเอเชียตะวันออกเฉียงใต้ทั้งสิ้น โดยอาเซียน มีชื่อเรียกเต็มๆ ว่า Association of Southeast Asian Nations หรือ สมาคมประชาชาติแห่งเอเชียตะวันออกเฉียงใต้')
    elif (userText == '2') :
        sendText(user,'ประวัติของอาเซียน  เป็นการพัฒนามาจากการเป็น สมาคมประชาชาติแห่งเอเชียตะวันออกเฉียงใต้ ก่อตั้งขึ้นตามปฏิญญากรุงเทพฯ  เมื่อ 8 สิงหาคม 2510 โดยมีประเทศผู้ก่อตั้งแรกเริ่ม 5 ประเทศ คือ อินโดนีเซีย มาเลเซีย ฟิลิปปินส์ สิงคโปร์ และไทย ต่อมาในปี 2527 บรูไน ก็ได้เข้าเป็นสมาชิก ตามด้วย 2538 เวียดนาม ก็เข้าร่วมเป็นสมาชิก ต่อมา 2540 ลาวและพม่า เข้าร่วม และปี 2542 กัมพูชาก็ได้เข้าร่วมเป็นสมาชิกลำดับที่ 10 ทำให้ปัจจุบันอาเซียนเป็นกลุ่มเศรษฐกิจภูมิภาคขนาดใหญ่ มีประชากร รวมกันเกือบ 500 ล้านคน จากนั้นในการประชุมสุดยอดอาเซียนครั้งที่  9 ที่อินโดนีเซีย เมื่อ 7 ต.ค.  2546  ผู้นำประเทศสมาชิกอาเซียนได้ตกลงกันที่จะจัดตั้งประชาคมอาเซียน ซึ่งประกอบด้วย 3 เสาหลัก คือ 1.ประชาคมเศรษฐกิจอาเซียน 2.ประชาคมสังคมและวัฒนธรรมอาเซียน 3.ประชาคมความมั่นคงอาเซียน')
    elif (userText == '3') :
        sendText(user,'ผู้ก่อตั้ง ผู้แทนทั้ง 5 ประเทศ ประกอบด้วย 1.นายอาดัม มาลิก(รัฐมนตรีต่างประเทศอินโดนีเซีย) 2.นายตุน อับดุล ราชัก บิน ฮุสเซน(รองนายกรัฐมนตรี รัฐมนตรีกลาโหมและรัฐมนตรีกระทรวงพัฒนาการแห่งชาติมาเลเซีย)  3.นายนาซิโซ รามอส (รัฐมนตรีต่างประเทศฟิลิปปินส์) 4.นายเอส ราชารัตนัม (รัฐมนตรีต่างประเทศสิงค์โปร์)  5.พันเอก(พิเศษ)ถนัด คอมันตร์ (รัฐมนตรีว่าการกระทรวงการต่างประเทศของไทย)')
    elif (userText == '4') :
        sendText(user,'คำขวัญอาเซียน คือ หนึ่งวิสัยทัศน์ หนึ่งเอกลักษณ์ หนึ่งประชาคม หรือ  One Vision One Identity One Community')
    elif (userText == '5') :
        sendText(user,'สัญลักษณ์ของอาเซียน เป็นรูปมัดรวงข้าวสีเหลืองบนพื้นวงกลมสีแดงล้อมรอบด้วยวงกลมสีขาวและสีน้ำเงิน รวงข้าวสีเหลือง 10 ต้นมัดรวมกันไว้ หมายถึง ประเทศในภูมิภาคเอเชียตะวันออกเฉียงใต้ทั้ง 10 ประเทศรวมกัน เพื่อมิตรภาพและความเป็นน้ำหนึ่งใจเดียวกัน วงกลม เป็นสัญลักษณ์แสดงถึงเอกภาพของอาเซียน ตัวอักษรคำว่า  asean  สีน้ำเงิน  อยู่ใต้ภาพรวงข้าว  แสดงถึงความมุ่งมั่นที่จะทำงานร่วมกันเพื่อความมั่นคง  สันติภพ  เอกภาพ  และความก้าวหน้าของประเทศสมาชิกอาเซียน สีเหลือง หมายถึง ความเจริญรุ่งเรือง สีแดง หมายถึง ความกล้าหาญและการมีพลวัติ สีขาว หมายถึง ความบริสุทธิ์ สีน้ำเงิน หมายถึง สันติภาพและความมั่นคง')
    elif (userText == '6') :
        sendText(user,'กฎบัตรอาเซียน เปรียบได้กับ ธรรมนูญของอาเซียน ซึ่งเป็นร่างสนธิสัญญาที่ประเทศสมาชิกอาเซียนทำร่วมกัน เพื่อเป็นการวางกรอบกฎหมาย แนวปฏิบัติ ขอบเขต ความรับผิดชอบต่าง ๆ รวมทั้งโครงสร้างองค์กรให้กับอาเซียน ให้เป็นไปภายใต้กฎหมายเดียวกัน ซึ่งสามารถปรับปรุง แก้ไข และสร้างกลไกใหม่ขึ้นมาได้ เพื่อให้สอดคล้องกับความเปลี่ยนแปลงในโลกปัจจุบัน ซึ่งกฎบัตรอาเซียนนี้มีผลทำให้องค์กรอาเซียนมีสถานะเป็นนิติบุคคล')
    elif (userText == '7') :
        sendText(user,'วันอาเซียน มีต้นกำเนิดจากวันก่อตั้งสมาคมอาเซียน ที่ตัวแทนจาก 5 ประเทศสมาชิกได้แก่ อินโดนีเซีย ฟิลิปปินส์ มาเลเซีย สิงคโปร์ และไทย ได้มาร่วมลงนามความร่วมมือ ที่วังสราญรมย์ กรุงเทพฯ เมื่อวันที่ 8 สิงหาคม 2510 โดยมีจุดมุ่งหมาย คือ เพื่อให้ความร่วมมือกันทางเศรษฐกิจ สังคม และวัฒนธรรม เพื่อยกระดับการครองชีพและฐานะทางเศรษฐกิจ และความเจริญในทางเทคนิค วิชาการร่วมกันระหว่างประเทศสมาชิก')
    elif (userText == '8') :
        sendText(user,'เนื้อเพลงประจำอาเซียน “The ASEAN Way” Raise our flag high, sky high Embrace the pride in our heart ASEAN we are bonded as one Look-in out to the worFor peace, our goal from the very start And prosperity to last.We dare to dream we care to share. Together for ASEAN we dare to dream, we care to share for it’s the way of ASEAN. เนื้อร้องภาษาไทยอย่างเป็นทางการ พลิ้วลู่ลม โบกสะบัด ใต้หมู่ธงปลิวไสว สัญญาณแห่งสัญญาทางใจ วันที่เรามาพบกับ อาเซียนเป็นหนึ่งดังที่ใจเราปรารถนา เราพร้อมเดินหน้าไปทางนั้น หล่อหลอมจิตใจให้เป็นหนึ่งเดียว อาเซียนยึดเหนี่ยวสัมพันธ์ ให้สังคมนี้มีแต่แบ่งปัน เศรษฐกิจสังคมก้าวไกล')
    elif (userText == '9') :       
        sendText(user,'ประเทศสมาชิกในอาเซียนได้แก่ 9.1 เนการาบรูไนดารุสซาลาม 9.2 ราชอาณาจักรกัมพูชา 9.3 สาธารณรัฐอินโดนีเซีย 9.4 สาธารณรัฐประชาธิปไตยประชาชนลาว 9.5 มาเลเซีย 9.6 สาธารณรัฐแห่งสหภาพเมียนมาร์ 9.7 สาธารณรัฐฟิลิปปินส์ 9.8 สาธารณรัฐสิงคโปร์ 9.9 ราชอาณาจักรไทย  9.10 สาธารณรัฐสังคมนิยมเวียดนาม  ')
    elif (userText == '9.1') :   
        sendText(user,'เนการาบรูไนดารุสซาลาม : Negara Brunei Darussalam  การปกครอง : สมบูรณาญาสิทธิราช  ประมุข : สมเด็จพระราชาธิบดีฮัจญี ฮัสซานัล โบลเกียห์ มูอิซซัดดิน วัดเดาเลาะห์ เมืองหลวง : บันดาร์เสรีเบกาวัน ภาษาราชการ : ภาษามาเลย์, ภาษาอาหรับ หน่วยเงินตรา : บรูไนดอลลาร์ ดอกไม้ประจำชาติ : ดอก Simpor หรือที่เรารู้จักกันในชื่อดอก Dillenia')
    elif (userText == '9.2') :  
        sendText(user,'ราชอาณาจักรกัมพูชา : Kingom of Cambodia การปกครอง : ระบอบประชาธิปไตย ประมุข : พระบาทสมเด็จพระบรมนาถนโรดม สีหมุนี เมืองหลวง : กรุงพนมเปญ ภาษาราชการ : ภาษาเขมรหน่วยเงินตรา : เรียล ดอกไม้ประจำชาติ : ดอก Rumdul ก็คือดอก ลำดวน')
    elif (userText == '9.3') :
        sendText(user,'สาธารณรัฐอินโดนีเซีย : Republic of Indonesia การปกครอง : ระบอบสาธารณรัฐแบบประชาธิปไตย ประมุข : พลโทซูซีโล บัมบัง ยูโดโยโน เมืองหลวง : กรุงจาการ์ตา ภาษาราชการ : ภาษาบาร์ฮาซา, ภาษาอินโดนีเซีย หน่วยเงินตรา : รูเปียห์ ดอกไม้ประจำชาติ : ดอก Moon Orchid กล้วยไม้ราตรีง')
    elif (userText == '9.4') :
        sendText(user,'สาธารณรัฐประชาธิปไตยประชาชนลาว : The Loa People Democratic Republic การปกครอง : ระบอบสังคมนิยม ประมุข : พลโทจูมมะลี ไซยะสอน เมืองหลวง : นครหลวงเวียงจันทน์ ภาษาราชการ : ภาษาลาว หน่วยเงินตรา : กีบ ดอกไม้ประจำชาติของ  : ลีลาวดี หรือลั่นทม')
    elif (userText == '9.5') :
        sendText(user,'มาเลเซีย : Malaysia การปกครอง : สหพันธรัฐ โดยมีสมเด็จพระราชาธิบดีเป็นประมุข ประมุข : สมเด็จพระราชาธิบดีสุลต่านตวนกู อับดุล ฮาลิม มูอัซซอม ซาร์ เมืองหลวง : กรุงกัวลาลัมเปอร์ ภาษาราชการ : ภาษามาเลย์ หน่วยเงินตรา : ริงกิต ดอกไม้ประจำชาติ : Hibiscus หรือ ชบา')
    elif (userText == '9.6') :
        sendText(user,'สาธารณรัฐแห่งสหภาพเมียนมาร์ : Republic of the Union of the Myanmar การปกครอง : ระบบประธานาธิบดี ประมุข : พลเอกเต็ง เส่ง เมืองหลวง : นครเนปิดอร์ ภาษาราชการ : ภาษาพม่า หน่วยเงินตรา : จั๊ต ดอกไม้ประจำชาติ : Padauk ประดู่')
    elif (userText == '9.7') :
        sendText(user,'สาธารณรัฐฟิลิปปินส์ : Republic of the Philippine  การปกครอง : สาธารณรัฐเดี่ยวระบบประธานาธิบดี  ประมุข : เบนิกโน อากีโน ที่ 3  เมืองหลวง : กรุงมะลิลา  ภาษาราชการ : ภาษาตากาล๊อก, ภาษาอังกฤษ  หน่วยเงินตรา : เปโซ  ดอกไม้ประจำชาติ : Sampaguita Jasmine ดอกพุดแก้ว')
    elif (userText == '9.8') :
        sendText(user,'สาธารณรัฐสิงคโปร์ : Republic of Singapore  การปกครอง : ระบบสาธารณรัฐแบบรัฐสภา มีประธานาธิบดีเป็นประมุข  ประมุข : โทนี ตัน เค็ง ยัม  เมืองหลวง : สิงคโปร์  ภาษาราชการ : ภาษาอังกฤษ, ภาษาจีนกลาง, ภาษามาเลย์, ภาษาทมิฬ  หน่วยเงินตรา : ดอลล่าร์สิงคโปร์  ดอกไม้ประจำชาติ : Vanda Miss Joaquim')
    elif (userText == '9.9') :
        sendText(user,'ราชอาณาจักรไทย : Kingdom of Thailand  การปกครอง : ระบอบประชาธิปไตย อันมีพระมหากษัตริย์เป็นประมุข  ประมุข : พระบาทสมเด็จพระปรมินทรมหาภูมิพลอดุลยเดช  เมืองหลวง : กรุงเทพมหานคร  ภาษาราชการ : ภาษาไทย  หน่วยเงินตรา : บาท  ดอกไม้ประจำชาติ : ราชพฤกษ์ หรือ ดอกคูน')
    elif (userText == '9.10') :
        sendText(user,'สาธารณรัฐสังคมนิยมเวียดนาม : Socialist Republic of Vietnam  การปกครอง : ระบอบสังคมนิยมเวียดนาม  ประมุข : เจือง เติ๋น ซาง  เมืองหลวง : กรุงฮานอย  ภาษาราชการ : ภาษาเวียดนาม  หน่วยเงินตรา : ด่อง  ดอกไม้ประจำชาติ : บัว')
    elif (userText == '10') :
        sendText(user,'ความรู้เพิ่มเติมเกี่ยวกับอาเซียน อาเซียน + 1 คือ การสถาปนาความสัมพันธ์ของประเทศคู่เจรจา 9 ประเทศ ได้แก่ ออสเตรเลีย แคนนาดา นิวซีแลนด์ สหัฐอเมริกา ญี่ปุ่น จีน  สาธารรัฐเกาหลี อินเดีย และ รัสเซีย  อาเซียน + 3 คือ การเข้าร่วมสถาปนากับ 3 ประเทศ ได้แก่ ญี่ปุ่น จีน และ สาธารรัฐเกาหลี    อาเซียน + 6 คือ การเข้าร่วมสถาปนา กับ 3 ประเทศ ได้แก่ ออสเตรเลีย อินเดีย ทและ นิวซีแลนด์     อาเซียน + 8 คือ การเข้าร่วมสถาปนา กับ 8 ประเทศ ได้แก่  สหรัฐอเมริกา จีน รัสเซีย ญี่ปุ่น เกาหลีใต้ อินเดีย ออสเตรเลีย และนิวซีแลนด์')

    return '',200

def sendText(user, text):
  LINE_API = 'https://api.line.me/v2/bot/message/reply'
  headers = {
    'Content-Type': 'application/json; charset=UTF-8',
    'Authorization': os.environ['Authorization']    # ตั้ง Config vars ใน heroku พร้อมค่า Access token
  }
  data = json.dumps({
    "replyToken":user,
    "messages":[{"type":"text","text":text}]
  })
  r = requests.post(LINE_API, headers=headers, data=data) # ส่งข้อมูล

if __name__ == '__main__':
    app.run()
